package org.gstreamer.video;

import io.github.jwharm.javagi.*;
import java.lang.foreign.*;
import java.lang.invoke.*;
import org.jetbrains.annotations.*;

/**
 * Information for a video format.
 */
public class VideoFormatInfo extends Struct {
    
    static {
        GstVideo.javagi$ensureInitialized();
    }
    
    private static final java.lang.String C_TYPE_NAME = "GstVideoFormatInfo";
    
    private static final GroupLayout memoryLayout = MemoryLayout.structLayout(
        Interop.valueLayout.C_INT.withName("format"),
        MemoryLayout.paddingLayout(32),
        Interop.valueLayout.ADDRESS.withName("name"),
        Interop.valueLayout.ADDRESS.withName("description"),
        Interop.valueLayout.C_INT.withName("flags"),
        Interop.valueLayout.C_INT.withName("bits"),
        Interop.valueLayout.C_INT.withName("n_components"),
        MemoryLayout.paddingLayout(96),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("shift"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("depth"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("pixel_stride"),
        Interop.valueLayout.C_INT.withName("n_planes"),
        MemoryLayout.paddingLayout(96),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("plane"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("poffset"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("w_sub"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_INT).withName("h_sub"),
        Interop.valueLayout.C_INT.withName("unpack_format"),
        MemoryLayout.paddingLayout(32),
        Interop.valueLayout.ADDRESS.withName("unpack_func"),
        Interop.valueLayout.C_INT.withName("pack_lines"),
        MemoryLayout.paddingLayout(32),
        Interop.valueLayout.ADDRESS.withName("pack_func"),
        Interop.valueLayout.C_INT.withName("tile_mode"),
        Interop.valueLayout.C_INT.withName("tile_ws"),
        Interop.valueLayout.C_INT.withName("tile_hs"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.ADDRESS).withName("_gst_reserved")
    ).withName(C_TYPE_NAME);
    
    /**
     * The memory layout of the native struct.
     * @return the memory layout
     */
    @ApiStatus.Internal
    public static MemoryLayout getMemoryLayout() {
        return memoryLayout;
    }
    
    private MemorySegment allocatedMemorySegment;
    
    /**
     * Allocate a new {@link VideoFormatInfo}
     * @return A new, uninitialized @{link VideoFormatInfo}
     */
    public static VideoFormatInfo allocate() {
        MemorySegment segment = Interop.getAllocator().allocate(getMemoryLayout());
        VideoFormatInfo newInstance = new VideoFormatInfo(segment.address(), Ownership.NONE);
        newInstance.allocatedMemorySegment = segment;
        return newInstance;
    }
    
    /**
     * Get the value of the field {@code format}
     * @return The value of the field {@code format}
     */
