package org.gstreamer.mpegts;

import io.github.jwharm.javagi.*;
import java.lang.foreign.*;
import java.lang.invoke.*;
import org.jetbrains.annotations.*;

/**
 * ## Generic usage of sections with {@code GstMpegtsSection}
 * <p>
 * The {@code GstMpegtsSection} object is the representation of MPEG-TS Section (SI or
 * PSI).
 * <p>
 * Various elements can post those on the bus via {@code GstMessage} of type
 * {@link org.gstreamer.gst.MessageType#ELEMENT}. The gst_message_parse_mpegts_section() function
 * provides access to the section.
 * <p>
 * Applications (or other elements) can create them either by using one of the
 * {@code gst_mpegts_section_from_*} functions, or by providing the raw SI data via
 * gst_mpegts_section_new().
 * <p>
 * Elements outputting MPEG-TS streams can also create sections using the
 * various convenience functions and then get the packetized data (to be
 * inserted in MPEG-TS packets) using gst_mpegts_section_packetize().
 * <p>
 * For more details, refer to the ITU H.222.0 or ISO/IEC 13818-1 specifications
 * and other specifications mentioned in the documentation.
 * <p>
 * <strong>Supported base MPEG-TS sections</strong><br/>
 * These are the sections for which parsing and packetizing code exists.
 * <p>
 * <strong>Program Association Table (PAT)</strong><br/>
 * See:
 * * gst_mpegts_section_get_pat()
 * * gst_mpegts_pat_program_new()
 * * {@code GstMpegtsPatProgram}
 * <p>
 * <strong>Conditional Access Table (CAT)</strong><br/>
 * See:
 * * gst_mpegts_section_get_cat()
 * <p>
 * <strong>Program Map Table (PMT)</strong><br/>
 * See:
 * * {@code GstMpegtsPMT}
 * * gst_mpegts_section_get_pmt()
 * * gst_mpegts_pmt_new()
 * * {@code GstMpegtsPMTStream}
 * <p>
 * <strong>Transport Stream Description Table (TSDT)</strong><br/>
 * See:
 * * gst_mpegts_section_get_tsdt()
 * <strong>API</strong><br/>
 */
public class Section extends Struct {
    
    static {
        GstMpegts.javagi$ensureInitialized();
    }
    
    private static final java.lang.String C_TYPE_NAME = "GstMpegtsSection";
    
    private static final GroupLayout memoryLayout = MemoryLayout.structLayout(
        org.gstreamer.gst.MiniObject.getMemoryLayout().withName("parent"),
        Interop.valueLayout.C_INT.withName("section_type"),
        Interop.valueLayout.C_SHORT.withName("pid"),
        Interop.valueLayout.C_BYTE.withName("table_id"),
        MemoryLayout.paddingLayout(8),
        Interop.valueLayout.C_SHORT.withName("subtable_extension"),
        Interop.valueLayout.C_BYTE.withName("version_number"),
        MemoryLayout.paddingLayout(8),
        Interop.valueLayout.C_INT.withName("current_next_indicator"),
        Interop.valueLayout.C_BYTE.withName("section_number"),
        Interop.valueLayout.C_BYTE.withName("last_section_number"),
        MemoryLayout.paddingLayout(16),
        Interop.valueLayout.C_INT.withName("crc"),
        Interop.valueLayout.ADDRESS.withName("data"),
        Interop.valueLayout.C_INT.withName("section_length"),
        MemoryLayout.paddingLayout(32),
        Interop.valueLayout.ADDRESS.withName("cached_parsed"),
        Interop.valueLayout.ADDRESS.withName("destroy_parsed"),
        Interop.valueLayout.C_LONG.withName("offset"),
        Interop.valueLayout.C_INT.withName("short_section"),
        MemoryLayout.paddingLayout(32),
        Interop.valueLayout.ADDRESS.withName("packetizer"),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.ADDRESS).withName("_gst_reserved")
    ).withName(C_TYPE_NAME);
    
    /**
     * The memory layout of the native struct.
     * @return the memory layout
     */
    @ApiStatus.Internal
    public static MemoryLayout getMemoryLayout() {
        return memoryLayout;
    }
    
    private MemorySegment allocatedMemorySegment;
    
    /**
     * Allocate a new {@link Section}
     * @return A new, uninitialized @{link Section}
     */
    public static Section allocate() {
        MemorySegment segment = Interop.getAllocator().allocate(getMemoryLayout());
        Section newInstance = new Section(segment.address(), Ownership.NONE);
        newInstance.allocatedMemorySegment = segment;
        return newInstance;
    }
    
    /**
     * Get the value of the field {@code section_type}
