package org.gstreamer.codecs;

import io.github.jwharm.javagi.*;
import java.lang.foreign.*;
import java.lang.invoke.*;
import org.jetbrains.annotations.*;

public class Vp9FrameHeader extends Struct {
    
    static {
        GstCodecs.javagi$ensureInitialized();
    }
    
    private static final java.lang.String C_TYPE_NAME = "GstVp9FrameHeader";
    
    private static final GroupLayout memoryLayout = MemoryLayout.structLayout(
        Interop.valueLayout.C_BYTE.withName("profile"),
        Interop.valueLayout.C_BYTE.withName("bit_depth"),
        Interop.valueLayout.C_BYTE.withName("subsampling_x"),
        Interop.valueLayout.C_BYTE.withName("subsampling_y"),
        Interop.valueLayout.C_BYTE.withName("color_space"),
        Interop.valueLayout.C_BYTE.withName("color_range"),
        Interop.valueLayout.C_BYTE.withName("show_existing_frame"),
        Interop.valueLayout.C_BYTE.withName("frame_to_show_map_idx"),
        Interop.valueLayout.C_BYTE.withName("frame_type"),
        Interop.valueLayout.C_BYTE.withName("show_frame"),
        Interop.valueLayout.C_BYTE.withName("error_resilient_mode"),
        MemoryLayout.paddingLayout(8),
        Interop.valueLayout.C_INT.withName("width"),
        Interop.valueLayout.C_INT.withName("height"),
        Interop.valueLayout.C_BYTE.withName("render_and_frame_size_different"),
        MemoryLayout.paddingLayout(24),
        Interop.valueLayout.C_INT.withName("render_width"),
        Interop.valueLayout.C_INT.withName("render_height"),
        Interop.valueLayout.C_BYTE.withName("intra_only"),
        Interop.valueLayout.C_BYTE.withName("reset_frame_context"),
        Interop.valueLayout.C_BYTE.withName("refresh_frame_flags"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.sequenceLayout(3, Interop.valueLayout.C_BYTE).withName("ref_frame_idx"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.sequenceLayout(4, Interop.valueLayout.C_BYTE).withName("ref_frame_sign_bias"),
        Interop.valueLayout.C_BYTE.withName("allow_high_precision_mv"),
        Interop.valueLayout.C_BYTE.withName("interpolation_filter"),
        Interop.valueLayout.C_BYTE.withName("refresh_frame_context"),
        Interop.valueLayout.C_BYTE.withName("frame_parallel_decoding_mode"),
        Interop.valueLayout.C_BYTE.withName("frame_context_idx"),
        MemoryLayout.paddingLayout(56),
        org.gstreamer.codecs.Vp9LoopFilterParams.getMemoryLayout().withName("loop_filter_params"),
        org.gstreamer.codecs.Vp9QuantizationParams.getMemoryLayout().withName("quantization_params"),
        org.gstreamer.codecs.Vp9SegmentationParams.getMemoryLayout().withName("segmentation_params"),
        Interop.valueLayout.C_BYTE.withName("tile_cols_log2"),
        Interop.valueLayout.C_BYTE.withName("tile_rows_log2"),
        Interop.valueLayout.C_SHORT.withName("header_size_in_bytes"),
        Interop.valueLayout.C_INT.withName("tx_mode"),
        Interop.valueLayout.C_INT.withName("reference_mode"),
        MemoryLayout.paddingLayout(32),
        org.gstreamer.codecs.Vp9DeltaProbabilities.getMemoryLayout().withName("delta_probabilities"),
        Interop.valueLayout.C_BYTE.withName("lossless_flag"),
        MemoryLayout.paddingLayout(24),
        Interop.valueLayout.C_INT.withName("frame_header_length_in_bytes")
    ).withName(C_TYPE_NAME);
    
    /**
     * The memory layout of the native struct.
     * @return the memory layout
     */
    @ApiStatus.Internal
    public static MemoryLayout getMemoryLayout() {
        return memoryLayout;
    }
    
    private MemorySegment allocatedMemorySegment;
    
    /**
     * Allocate a new {@link Vp9FrameHeader}
     * @return A new, uninitialized @{link Vp9FrameHeader}
     */
    public static Vp9FrameHeader allocate() {
        MemorySegment segment = Interop.getAllocator().allocate(getMemoryLayout());
        Vp9FrameHeader newInstance = new Vp9FrameHeader(segment.address(), Ownership.NONE);
        newInstance.allocatedMemorySegment = segment;
        return newInstance;
    }
    
    /**
     * Get the value of the field {@code profile}
     * @return The value of the field {@code profile}
     */
    public byte profile$get() {
